---
title: ExportLinetypeTableIterator
classe: Autodesk.Revit.DB.ExportLinetypeTableIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ExportLinetypeTableIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo> Current { get; }` | `exportLinetypeTableIterator.Current` | KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo> |
| `Boolean IsValidObject { get; }` | `exportLinetypeTableIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `exportLinetypeTableIterator.Dispose()` | Void |
| `Boolean IsDone()` | `exportLinetypeTableIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `exportLinetypeTableIterator.MoveNext()` | Boolean |
| `Void Reset()` | `exportLinetypeTableIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```